In [93]:
import pandas as pd
import numpy as np

In [94]:
##创建dataframe
data = {'country':['sa','ws','sw'],
        'population':[12,23,12]}
df_data = pd.DataFrame(data)
df_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
country       3 non-null object
population    3 non-null int64
dtypes: int64(1), object(1)
memory usage: 128.0+ bytes

In [125]:
import pandas as pd
##读取
df = pd.read_csv('train.csv')
df.info()
df =df.set_index('datetime') #设置索引
df.head()
df.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10886 entries, 0 to 10885
Data columns (total 12 columns):
datetime      10886 non-null object
season        10886 non-null int64
holiday       10886 non-null int64
workingday    10886 non-null int64
weather       10886 non-null int64
temp          10886 non-null float64
atemp         10886 non-null float64
humidity      10886 non-null int64
windspeed     10886 non-null float64
casual        10886 non-null int64
registered    10886 non-null int64
count         10886 non-null int64
dtypes: float64(3), int64(8), object(1)
memory usage: 1020.6+ KB

,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
count,10886.000000,10886.000000,10886.000000,10886.000000,10886.00000,10886.000000,10886.000000,10886.000000,10886.000000,10886.000000,10886.000000
mean,2.506614,0.028569,0.680875,1.418427,20.23086,23.655084,61.886460,12.799395,36.021955,155.552177,191.574132
std,1.116174,0.166599,0.466159,0.633839,7.79159,8.474601,19.245033,8.164537,49.960477,151.039033,181.144454
min,1.000000,0.000000,0.000000,1.000000,0.82000,0.760000,0.000000,0.000000,0.000000,0.000000,1.000000
25%,2.000000,0.000000,0.000000,1.000000,13.94000,16.665000,47.000000,7.001500,4.000000,36.000000,42.000000
50%,3.000000,0.000000,1.000000,1.000000,20.50000,24.240000,62.000000,12.998000,17.000000,118.000000,145.000000
75%,4.000000,0.000000,1.000000,2.000000,26.24000,31.060000,77.000000,16.997900,49.000000,222.000000,284.000000
max,4.000000,1.000000,1.000000,4.000000,41.00000,45.455000,100.000000,56.996900,367.000000,886.000000,977.000000

In [97]:
#series 操作
temp = df['temp']
print(temp.index)
print(temp.values[:5]) #得到ndarray
print(temp[:5])
print(temp.max())
print(temp.min())
print(temp.mean())

Index(['2011-01-01 00:00:00', '2011-01-01 01:00:00', '2011-01-01 02:00:00',
       '2011-01-01 03:00:00', '2011-01-01 04:00:00', '2011-01-01 05:00:00',
       '2011-01-01 06:00:00', '2011-01-01 07:00:00', '2011-01-01 08:00:00',
       '2011-01-01 09:00:00',
       ...
       '2012-12-19 14:00:00', '2012-12-19 15:00:00', '2012-12-19 16:00:00',
       '2012-12-19 17:00:00', '2012-12-19 18:00:00', '2012-12-19 19:00:00',
       '2012-12-19 20:00:00', '2012-12-19 21:00:00', '2012-12-19 22:00:00',
       '2012-12-19 23:00:00'],
      dtype='object', name='datetime', length=10886)
[9.84 9.02 9.02 9.84 9.84]
datetime
2011-01-01 00:00:00    9.84
2011-01-01 01:00:00    9.02
2011-01-01 02:00:00    9.02
2011-01-01 03:00:00    9.84
2011-01-01 04:00:00    9.84
Name: temp, dtype: float64
41.0
0.82
20.230859819952173

In [101]:
##pandas 索引
# 列索引，直接用列名
print(df[['holiday','windspeed']][56:62])
# loc 用label去定位
# iloc 用位置定位
print(df.iloc[23:29,2:5])
print(df.loc['2011-01-01 01:00:00'])
print(df.loc['2011-01-01 01:00:00':'2011-01-01 04:00:00'])
#索引切片操作
df.loc['2011-01-01 03:00:00','season']=0
#赋值操作
df.head()
#布尔类型的索引
print(df[df['atemp']>44])
print(df.loc[df['season']==3,'temp'].mean())

                     holiday  windspeed
datetime
2011-01-03 11:00:00        0    22.0028
2011-01-03 12:00:00        0    19.9995
2011-01-03 13:00:00        0    19.0012
2011-01-03 14:00:00        0    19.0012
2011-01-03 15:00:00        0    16.9979
2011-01-03 16:00:00        0    16.9979
                     workingday  weather   temp
datetime
2011-01-01 23:00:00           0        2  18.86
2011-01-02 00:00:00           0        2  18.86
2011-01-02 01:00:00           0        2  18.04
2011-01-02 02:00:00           0        2  17.22
2011-01-02 03:00:00           0        2  18.86
2011-01-02 04:00:00           0        2  18.86
season         1.000
holiday        0.000
workingday     0.000
weather        1.000
temp           9.020
atemp         13.635
humidity      80.000
windspeed      0.000
casual         8.000
registered    32.000
count         40.000
Name: 2011-01-01 01:00:00, dtype: float64
                     season  holiday  workingday  weather  temp   atemp  \
datetime
2011-01-01 01:00:00       1        0           0        1  9.02  13.635
2011-01-01 02:00:00       1        0           0        1  9.02  13.635
2011-01-01 03:00:00       1        0           0        1  9.84  14.395
2011-01-01 04:00:00       1        0           0        1  9.84  14.395

                     humidity  windspeed  casual  registered  count
datetime
2011-01-01 01:00:00        80        0.0       8          32     40
2011-01-01 02:00:00        80        0.0       5          27     32
2011-01-01 03:00:00        75        0.0       3          10     13
2011-01-01 04:00:00        75        0.0       0           1      1

,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
datetime,,,,,,,,,,,
2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40
2011-01-01 02:00:00,1,0,0,1,9.02,13.635,80,0.0,5,27,32
2011-01-01 03:00:00,0,0,0,1,9.84,14.395,75,0.0,3,10,13
2011-01-01 04:00:00,1,0,0,1,9.84,14.395,75,0.0,0,1,1

In [104]:
s= pd.Series(np.arange(5),index=np.arange(5)[::-1],dtype='int64')
print(s)
print(s.isin([1,3,4]))
print(s[s.isin([1,3,4])])

4    0
3    1
2    2
1    3
0    4
dtype: int64
4    False
3     True
2    False
1     True
0     True
dtype: bool
3    1
1    3
0    4
dtype: int64

In [105]:
s2=pd.Series (np.arange(6),index=pd.MultiIndex.from_product([[0,1],['a','b','c']]))
#双重索引
print(s2)
print(s2.iloc[s2.index.isin([(1,'a'),(0,'b')])])
print(s[s>2])

0  a    0
   b    1
   c    2
1  a    3
   b    4
   c    5
dtype: int32
0  b    1
1  a    3
dtype: int32
1    3
0    4
dtype: int64

In [107]:
dates = pd.date_range('20201211',periods=8)
df = pd.DataFrame(np.random.randn(8,4), index = dates, columns = ['A','B','C','D'])
print(df)
print(df.where(df<0, -df))
#小于0 的不动，大于0的取相反数

                   A         B         C         D
2020-12-11 -0.688483  2.537343 -1.656600 -0.053319
2020-12-12  0.681207  0.201327  0.275814 -2.174706
2020-12-13  0.035336  1.805015 -0.518119 -0.689047
2020-12-14  1.135417 -1.282389  0.598782 -0.160527
2020-12-15  1.135393 -0.165288  0.575763  1.380130
2020-12-16  0.511428 -0.424636  0.043098  0.603566
2020-12-17 -1.312657 -0.756731 -0.680350  0.770799
2020-12-18  2.182293 -1.974944  0.871750  0.133602
                   A         B         C         D
2020-12-11 -0.688483 -2.537343 -1.656600 -0.053319
2020-12-12 -0.681207 -0.201327 -0.275814 -2.174706
2020-12-13 -0.035336 -1.805015 -0.518119 -0.689047
2020-12-14 -1.135417 -1.282389 -0.598782 -0.160527
2020-12-15 -1.135393 -0.165288 -0.575763 -1.380130
2020-12-16 -0.511428 -0.424636 -0.043098 -0.603566
2020-12-17 -1.312657 -0.756731 -0.680350 -0.770799
2020-12-18 -2.182293 -1.974944 -0.871750 -0.133602

In [110]:
df = pd.DataFrame(np.random.randn(10,3), columns =list('abc'))
print(df)
print(df.query('(a>0) & (b<c)'))

          a         b         c
0 -2.226259 -0.046403  0.213395
1  1.269405 -0.849122  0.155443
2 -0.951632 -0.230373 -0.600612
3 -0.648529  0.900086  0.477696
4  0.686138  0.698752 -0.049762
5 -0.244633 -0.763713  1.092095
6 -1.389542 -0.790127  0.189747
7 -1.296374  1.877385  0.587876
8  0.449610  0.493403 -0.281801
9  1.404916 -0.374161  0.876932
          a         b         c
1  1.269405 -0.849122  0.155443
9  1.404916 -0.374161  0.876932

In [122]:
df = pd.DataFrame({'key':list('ABCABCABC'),
                    'data':[3,13,4,6,2,5,3,1,7]})
print(df)
print(df.groupby('key'))
print(df.groupby('key').sum())
df.groupby('key').aggregate(np.sum)

  key  data
0   A     3
1   B    13
2   C     4
3   A     6
4   B     2
5   C     5
6   A     3
7   B     1
8   C     7
<pandas.core.groupby.generic.DataFrameGroupBy object at 0x00000223BFA8BDD8>
     data
key
A      12
B      16
C      16

     data
key
A      12
B      16
C      16

In [138]:
df =pd.read_csv('titanic.csv')
print(df.head())
print(df.groupby('Sex')['Age'].mean())
print(df.groupby('Sex')['Survived'].mean())

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S
Sex
female    27.915709
male      30.726645
Name: Age, dtype: float64
Sex
female    0.742038
male      0.188908
Name: Survived, dtype: float64
        PassengerId  Survived  Pclass  Name  Age  SibSp  Parch  Ticket  Fare  \
Sex
female          314       314     314   314  261    314    314     314   314
male            577       577     577   577  453    577    577     577   577

        Cabin  Embarked
Sex
female     97       312
male      107       577
                 PassengerId  Survived  Pclass  Name  Age  SibSp  Parch  \
Sex    Embarked
female C                  73        73      73    73   61     73     73
       Q                  36        36      36    36   12     36     36
       S                 203       203     203   203  186    203    203
male   C                  95        95      95    95   69     95     95
       Q                  41        41      41    41   16     41     41
       S                 441       441     441   441  368    441    441

                 Ticket  Fare  Cabin
Sex    Embarked
female C             73    73     37
       Q             36    36      2
       S            203   203     56
male   C             95    95     32
       Q             41    41      2
       S            441   441     73

In [141]:
grouped=df.groupby('Sex')
print(grouped.count())
grouped=df.groupby(('Sex','Embarked'))
print(grouped.count())
df.groupby(['Embarked']).get_group("C")

        PassengerId  Survived  Pclass  Name  Age  SibSp  Parch  Ticket  Fare  \
Sex
female          314       314     314   314  261    314    314     314   314
male            577       577     577   577  453    577    577     577   577

        Cabin  Embarked
Sex
female     97       312
male      107       577
                 PassengerId  Survived  Pclass  Name  Age  SibSp  Parch  \
Sex    Embarked
female C                  73        73      73    73   61     73     73
       Q                  36        36      36    36   12     36     36
       S                 203       203     203   203  186    203    203
male   C                  95        95      95    95   69     95     95
       Q                  41        41      41    41   16     41     41
       S                 441       441     441   441  368    441    441

                 Ticket  Fare  Cabin
Sex    Embarked
female C             73    73     37
       Q             36    36      2
       S            203   203     56
male   C             95    95     32
       Q             41    41      2
       S            441   441     73

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.00,1,0,PC 17599,71.2833,C85,C
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.00,1,0,237736,30.0708,NaN,C
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C
26,27,0,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,2631,7.2250,NaN,C
30,31,0,1,"Uruchurtu, Don. Manuel E",male,40.00,0,0,PC 17601,27.7208,NaN,C
31,32,1,1,"Spencer, Mrs. William Augustus (Marie Eugenie)",female,NaN,1,0,PC 17569,146.5208,B78,C
34,35,0,1,"Meyer, Mr. Edgar Joseph",male,28.00,1,0,PC 17604,82.1708,NaN,C
36,37,1,3,"Mamee, Mr. Hanna",male,NaN,0,0,2677,7.2292,NaN,C
39,40,1,3,"Nicola-Yarred, Miss. Jamila",female,14.00,1,0,2651,11.2417,NaN,C
42,43,0,3,"Kraeff, Mr. Theodor",male,NaN,0,0,349253,7.8958,NaN,C
43,44,1,2,"Laroche, Miss. Simonne Marie Anne Andree",female,3.00,1,2,SC/Paris 2123,41.5792,NaN,C
48,49,0,3,"Samaan, Mr. Youssef",male,NaN,2,0,2662,21.6792,NaN,C
52,53,1,1,"Harper, Mrs. Henry Sleeper (Myna Haxtun)",female,49.00,1,0,PC 17572,76.7292,D33,C
54,55,0,1,"Ostby, Mr. Engelhart Cornelius",male,65.00,0,1,113509,61.9792,B30,C
57,58,0,3,"Novel, Mr. Mansouer",male,28.50,0,0,2697,7.2292,NaN,C
60,61,0,3,"Sirayanian, Mr. Orsen",male,22.00,0,0,2669,7.2292,NaN,C
64,65,0,1,"Stewart, Mr. Albert A",male,NaN,0,0,PC 17605,27.7208,NaN,C
65,66,1,3,"Moubarek, Master. Gerios",male,NaN,1,1,2661,15.2458,NaN,C
73,74,0,3,"Chronopoulos, Mr. Apostolos",male,26.00,1,0,2680,14.4542,NaN,C
96,97,0,1,"Goldschmidt, Mr. George B",male,71.00,0,0,PC 17754,34.6542,A5,C
97,98,1,1,"Greenfield, Mr. William Bertram",male,23.00,0,1,PC 17759,63.3583,D10 D12,C
111,112,0,3,"Zabour, Miss. Hileni",female,14.50,1,0,2665,14.4542,NaN,C
114,115,0,3,"Attalah, Miss. Malake",female,17.00,0,0,2627,14.4583,NaN,C
118,119,0,1,"Baxter, Mr. Quigg Edmond",male,24.00,0,1,PC 17558,247.5208,B58 B60,C
122,123,0,2,"Nasser, Mr. Nicholas",male,32.50,1,0,237736,30.0708,NaN,C
125,126,1,3,"Nicola-Yarred, Master. Elias",male,12.00,1,0,2651,11.2417,NaN,C
128,129,1,3,"Peter, Miss. Anna",female,NaN,1,1,2668,22.3583,F E69,C
130,131,0,3,"Drazenoic, Mr. Jozef",male,33.00,0,0,349241,7.8958,NaN,C
135,136,0,2,"Richard, Mr. Emile",male,23.00,0,0,SC/PARIS 2133,15.0458,NaN,C
139,140,0,1,"Giglio, Mr. Victor",male,24.00,0,0,PC 17593,79.2000,B86,C
...,...,...,...,...,...,...,...,...,...,...,...,...
716,717,1,1,"Endres, Miss. Caroline Louise",female,38.00,0,0,PC 17757,227.5250,C45,C
731,732,0,3,"Hassan, Mr. Houssein G N",male,11.00,0,0,2699,18.7875,NaN,C
737,738,1,1,"Lesurer, Mr. Gustave J",male,35.00,0,0,PC 17755,512.3292,B101,C
742,743,1,1,"Ryerson, Miss. Susan Parker ""Suzette""",female,21.00,2,2,PC 17608,262.3750,B57 B59 B63 B66,C
762,763,1,3,"Barah, Mr. Hanna Assi",male,20.00,0,0,2663,7.2292,NaN,C
766,767,0,1,"Brewe, Dr. Arthur Jackson",male,NaN,0,0,112379,39.6000,NaN,C
773,774,0,3,"Elias, Mr. Dibo",male,NaN,0,0,2674,7.2250,NaN,C
780,781,1,3,"Ayoub, Miss. Banoura",female,13.00,0,0,2687,7.2292,NaN,C
789,790,0,1,"Guggenheim, Mr. Benjamin",male,46.00,0,0,PC 17593,79.2000,B82 B84,C
793,794,0,1,"Hoyt, Mr. William Fisher",male,NaN,0,0,PC 17600,30.6958,NaN,C
798,799,0,3,"Ibrahim Shawah, Mr. Yousseff",male,30.00,0,0,2685,7.2292,NaN,C
803,804,1,3,"Thomas, Master. Assad Alexander",male,0.42,0,1,2625,8.5167,NaN,C
817,818,0,2,"Mallet, Mr. Albert",male,31.00,1,1,S.C./PARIS 2079,37.0042,NaN,C
827,828,1,2,"Mallet, Master. Andre",male,1.00,0,2,S.C./PARIS 2079,37.0042,NaN,C
830,831,1,3,"Yasbeck, Mrs. Antoni (Selini Alexander)",female,15.00,1,0,2659,14.4542,NaN,C
832,833,0,3,"Saad, Mr. Amin",male,NaN,0,0,2671,7.2292,NaN,C
835,836,1,1,"Compton, Miss. Sara Rebecca",female,39.00,1,1,PC 17756,83.1583,E49,C
839,840,1,1,"Marechal, Mr. Pierre",male,NaN,0,0,11774,29.7000,C47,C
842,843,1,1,"Serepeca, Miss. Augusta",female,30.00,0,0,113798,31.0000,NaN,C
843,844,0,3,"Lemberopolous, Mr. Peter L",male,34.50,0,0,2683,6.4375,NaN,C
847,848,0,3,"Markoff, Mr. Marin",male,35.00,0,0,349213,7.8958,NaN,C
849,850,1,1,"Goldenberg, Mrs. Samuel L (Edwiga Grabowska)",female,NaN,1,0,17453,89.1042,C92,C
852,853,0,3,"Boulos, Miss. Nourelain",female,9.00,1,1,2678,15.2458,NaN,C
858,859,1,3,"Baclini, Mrs. Solomon (Latifa Qurban)",female,24.00,0,3,2666,19.2583,NaN,C
859,860,0,3,"Razi, Mr. Raihed",male,NaN,0,0,2629,7.2292,NaN,C
866,867,1,2,"Duran y More, Miss. Asuncion",female,27.00,1,0,SC/PARIS 2149,13.8583,NaN,C
874,875,1,2,"Abelson, Mrs. Samuel (Hannah Wizosky)",female,28.00,1,0,P/PP 3381,24.0000,NaN,C
875,876,1,3,"Najib, Miss. Adele Kiamie ""Jane""",female,15.00,0,0,2667,7.2250,NaN,C
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.00,0,1,11767,83.1583,C50,C
889,890,1,1,"Behr, Mr. Karl Howell",male,26.00,0,0,111369,30.0000,C148,C